using System;
using System.Collections.Generic;
using System.Linq;
using System.Threading.Tasks;

namespace Real_Vagas_API.Repositories
{
    public class RedefinirRepository
    {
        public static string[] PrimeiroArray()
        {
            string[] letter = {"\\","<","½","r","A","H","c","~","Ü","Ñ","?","P","±","¹","4","u","Q","ª","Á","å","|","C","1","Ð","b","Ú","Þ","W",
            " ","ß","¸","ë","O","`","É","m","Î","_","º","B","J","Ê","X","Ë","³","y","V","¶","í","é",")","ù","Ç",">","f","K","M","÷","«","d","Ö",
            "¡","è","j","ã","á","ç","Ó","¦","Ø",".","e","G","×","À","Í","^","D","ú","*","q","!","ü","t","3","L","'","F","%","ø","Ý","$",";","Û",
            "g","&","©","§","U","o","0","p","Æ","Ã","h","¥","â","E","(",":","þ","Y",",","I","ö","+","õ","{","[","Ò","#","û","·","¿","ð","8","a",
            "²","®","¼","¯","à","T","Õ","µ","5","ò","v","l","Ï","£","w","@","¢","´","n","6","î","Ô","z","ô","-","\"","ó","9","æ","Å","ì","2","ñ",
            "ä","ï","ý","}","Z","i","]","ê","7","¬","Ä","Ù","¤","»","/","S","°","¾","R","x","=","¨","ÿ","N","È","k","Ì","Â","s"};

            return letter;
        }

        public static string[] SegundoArray()
        {
            string[] letter = {"Æ","ú","Þ","ÿ","c","«","M","E","ç","¤","9","@","³","è","¼","l","p","(","/","U","^","=","¦","õ","Ø","ß","¯",";",
            "¢","e","®"," ","f","Ì","·","ñ","ë","¿","u","º","ö","3","Î","5","x",":","]","m","Q","ô","L","T","C","Ê","!","´","å","¥","q",")","Â","?",
            "\\","Ý","È","{","Ë","j","A","µ","o","h","Ñ","G","[","+","W","»","R","û","ï","¸","à","Ä","÷","§","ä","n","4","t","×","|","Õ","6","é",
            "î",">","Ó","Ð","d","Ç","0","~","¡","X","Ã","í","Ü","ü","-","ã","S","k","`","g","ì","J","Ú","'","¶","s","F","Í","ý","ð","Z","#","æ",
            "r","%","Ù","B","É","O","&","â","£","ù","\"","ó","*","w","¾","þ","y","À","±","Û","Ô","¨","z","ò","V","_","I","i","2","7","1","Ï","Å",
            "P","b",".","8","ê","Y","²","K","N","¬","v","D","$","Á","H","á","Ò","<","ª",",","ø","}","¹","½","°","©","a","Ö"};

            return letter;
        }

        public static string Hash_1()
        {
            string letter = "k5513577lA7874882810LKp44Tx666784h882x4957042v5I90747232UW876959iFU7362W5086I02nP108y6442L03t5" +
                "myD6491249FMHT2Y7364dFb8cY4as63532c4s343v9735866gz487J14f160Q2f9I32aFl04F376906Q438E7572c67o4541x33tJ156749" +
                "6E8y05yO6854er776U7Z4D204m211982D7225431i38nI36435H368L98l214r326B4b90559683T8L35975t82m685759X86350JA4D765" +
                "Uk3vAKt1855k74M2w1559E15187A556BPP92365H280697g994To16374AU561035485363L1749092139E997137543DN4819l9HF3QX39" +
                "225z305teXY04782z98i069216sU6K9h5r570794ETT4o4Fk50c8F83V952q3632Gm23145964D80usa847nef330F199435223361j5216" +
                "28b0589cVh833554QF553i5a00297w3873r48P424D3rgjd8x9P7l59g39j55RR6o559286s7U60RH7d96i913e647m5X25138885422f4G" +
                "386157Vz3y03a7884aNk434U40180550527Ak4932108cB9kM542967L6k862uU39f87966405C1987W517s7q7355GVkr0Mu1770Y7r4n4" +
                "263q5I79T7x41O1283L009784Yj3s0ECy2c663L1VU85W099k20I868I17248227n83H93";

            return letter;
        }

        public static string Hash_2()
        {

            string letter = "474515KHvm8789Z1C67023s5c54w5288g261829y16288wO29Iv32717c81878l0999990jY714849514p24z2f262Y56XN" +
                "cs5952i87j3274dz68g4Ea9TbA47286137258II3Y2F9375y5SL97b887S517jW43E8161oA76926486737398E8P5486C7722T98513s28" +
                "44U9649944y2666k2yIn451528893sxA19k48eW7u9x6VzV9X60p860250tFmIGT97579o1W8h1456iB3r6Bn57G2199zq31ZI2r7NTil34" +
                "717m38945mu5N8a4LX64V687488uB867731419605h484362O88464y8ZHPPv7n2x24V0b62660992Qh6sA98N58I5q589k364r7Pwe1841" +
                "462Ku6x49VQ15820k840850300198lq301e5lky497782X09L9868197774d03ou1035B4544C5p1091U59Zb266p32r0u39LvZ3904l9o6" +
                "2273ev32Y6F8gf79823Z74237u180oGC0304cz8Y33v1C65z9332w907r5Y9g45c0s2356c85H763zK2X538Ya068Y3T2X62U2981p40963" +
                "f712e4943kH7749A3Z6tREN338D92497zb46E6D9i9pEtD554667151195G70937P612l2e5I4349709z13158070n7N3q837yz5Y0h3032" +
                "i29syQU65T13c453H7S52I053479213603113GTS919T9sE74495215252C6X11707LILASz3bc03Nf96538J78714wsT3";

            return letter;
        }

        public static string[] Letras()
        {
            string[] Letters = { "a", "b", "c", "d", "e", "f", "g", "h", "i", "j", "k", "l", "m",
            "n", "o", "p", "q", "r", "s", "t", "u", "v", "w", "x", "y", "z", "A", "B", "C", "D",
            "E", "F", "G", "H", "I", "J", "K", "L", "M", "N", "O", "P", "Q", "R", "S", "T", "U",
            "V", "W", "X", "Y", "Z" };

            return Letters;
        }
    }
}
